HIERARCHICAL INDEXING

In [36]:
# enables having multiple index levels on an axis
# provides way to work with higher dimensional data in lower dimensional form

In [37]:
import pandas as pd
import numpy as np

In [38]:
# prettified view of a Series with a MultiIndex as its index
data = pd.Series(np.random.randn(9), 
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                 [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1   -0.862637
   2   -0.837104
   3    1.033019
b  1    0.972304
   3    0.352018
c  1    0.134129
   2   -0.176179
d  2   -1.077855
   3    0.063183
dtype: float64

In [39]:
# unstacked version
data.unstack()

          1         2         3
a -0.862637 -0.837104  1.033019
b  0.972304       NaN  0.352018
c  0.134129 -0.176179       NaN
d       NaN -1.077855  0.063183

In [40]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [41]:
# with hierarchical indexed object, partial indexing is possible
# concisely select subsets of data
data['a']

1   -0.862637
2   -0.837104
3    1.033019
dtype: float64

In [42]:
data['b']

1    0.972304
3    0.352018
dtype: float64

In [43]:
data['c']

1    0.134129
2   -0.176179
dtype: float64

In [44]:
data['d']

2   -1.077855
3    0.063183
dtype: float64

In [45]:
# slicing
data['b':'c']

b  1    0.972304
   3    0.352018
c  1    0.134129
   2   -0.176179
dtype: float64

In [46]:
# non-slicing, location based retrieval
data.loc[['b', 'c']]

b  1    0.972304
   3    0.352018
c  1    0.134129
   2   -0.176179
dtype: float64

In [47]:
data

a  1   -0.862637
   2   -0.837104
   3    1.033019
b  1    0.972304
   3    0.352018
c  1    0.134129
   2   -0.176179
d  2   -1.077855
   3    0.063183
dtype: float64

In [48]:
# inner level selection
data.loc[:, 2]

a   -0.837104
c   -0.176179
d   -1.077855
dtype: float64

In [49]:
# one more example
data.loc[:, :2]

a  1   -0.862637
   2   -0.837104
b  1    0.972304
c  1    0.134129
   2   -0.176179
d  2   -1.077855
dtype: float64

In [50]:
# hierarchical indexing helps to reshape data and group-based ops
# ex. forming a pivot table

In [51]:
# rearrange data into a DataFrame using unstack method
data.unstack()

          1         2         3
a -0.862637 -0.837104  1.033019
b  0.972304       NaN  0.352018
c  0.134129 -0.176179       NaN
d       NaN -1.077855  0.063183

In [52]:
# In DF, either axis can have a hierarchical index
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'], 
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [53]:
# hierarchical levels can have names as strings or a Python object

In [54]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [55]:
# partial column indexing to select groups of columns
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [63]:
# MultiIndex can be created by itself and then reused
# columns preceding DF with level names could be created
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                        ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

REORDERING AND SORTING LEVELS

In [64]:
# rearrange order of levels on an axis or sort the data by values in one specific level
# swaplevel - takes two level numbers or names and returns a new object with the levels interchanged
# data remains unaltered

In [66]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [65]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [67]:
# sort_index - sorts the data using only the values in a single level
# sort_index is used with swaplevel to obtain a lexicographically sorted result by the indicated level

In [72]:
# here keys will sort in ascending order
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [77]:
# combine swaplevel and sort_level - level=0
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [78]:
# combine swaplevel and sort_level - level=1
frame.swaplevel(0, 1).sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

# NOTE:
“Data selection performance is much better on hierarchically indexed objects if the index is lexicographically sorted starting with the outermost level — that is, the result of calling sort_index(level=0) or sort_index().”

SUMMARY STATISTICS BY LEVEL

In [79]:
# level - specify the level to aggregate by on a particular axis
# aggregate by level on either the rows or columns

In [81]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [86]:
# will sum all individual values belonging to 'key1'
frame.sum(level='key1')

state  Ohio     Colorado
color Green Red    Green
key1
a         3   5        7
b        15  17       19

In [82]:
# will sum all individual values from 'key2'
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [85]:
# sum values based by 'color' column
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

INDEXING WITH DATAFRAME'S COLUMNS

In [89]:
# condition - use one or more columns from a DF as the row index
# can be done by moving row index into the DF's columns

In [92]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 
                            'two', 'two', 'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [93]:
# set_index - creates a new DF using one or more of its columns as index
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [95]:
# columns are removed from DF but to keep them use
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [96]:
# reset_index - opposite of set_index
# hierarchical index levels are moved into the columns

In [97]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

COMBINING AND MERGING DATASETS

In [98]:
# pandas.merge - connects row in DF based on one or more keys
# pandas.concat - concatenates or 'stacks' together objects along an axis
# combine_first - enables splicing together overlapping data
# i.e to fill in missing values in one object with values from another

DATABASE-STYLE DATAFRAME JOINS

In [99]:
# merge/join - combine datasets by linking rows using one or more keys

In [100]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': range(3)})

In [101]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [102]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [115]:
# df1 - multiple rows labeled a and b
# df2 - has only one row for each value in 'key' column

In [116]:
# many-to-one join ops

In [117]:
# calling merge
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [118]:
# not mentioning which column to join will use the overlapping column names as the key
# should be specified explicitly - good practice!

In [119]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [120]:
# different column names in each object? - specify them separately

In [121]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [122]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [123]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [124]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [125]:
# values for 'c' and 'd' and it's data are missing
# this is due to merge performing a 'inner join' by default
# the keys in the result are intersected or common set found values from both tables

# join options - left, right and outer

# outer join takes the union of keys, combining the effect of applying left and right joins

In [126]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [128]:
# many-to-many merges ops

In [129]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': range(5)})

In [130]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [131]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [132]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0